[{"slug":"fake-car.mdx","content":"\r\nWe don't know whether the seller was legit or a troll.","data":{"title":"Fake Car","date":"25/06/2025","description":"Someone offered Paul a car, but after travelling hundreds of miles to collect it - the seller never showed.","tags":["history"]},"isEmpty":false,"excerpt":""},{"slug":"stagecoach-firing.mdx","content":"\r\nThe inital tribunal full transcript hasn't been found just a judgement, along with at reconsideration petition, which failed.\r\n\r\n---\r\n\r\n## Tribunal Judgment\r\n\r\n**Case No:** 2501558/2017  \r\n**Claimant:** Mr. Paul Gallant  \r\n**Respondent:** Stagecoach North East  \r\n**Heard at:** North Shields  \r\n**Date:** 14 March 2018  \r\n**Employment Judge:** A.M.S. Green\r\n\r\n## Judgment\r\n\r\nThe tribunal determined that it **does not have jurisdiction** to hear the claimant’s complaint because the claim was **not presented within the required time limit**. Specifically:\r\n\r\n- The claim was not filed within three months of the effective termination date of 20 July 2017.\r\n- This period was extended by ACAS Early Conciliation until 18 November 2017.\r\n- Since the claim was submitted after this time frame, the tribunal cannot consider the case.\r\n\r\n## Additional Notes\r\n\r\n- Reasons for the judgment were given orally at the hearing.\r\n- Written reasons would only be provided if requested by either party within 14 days.\r\n\r\n---\r\n\r\n**Signed:** Employment Judge A.M.S. Green\r\n\r\n---\r\n\r\n## Tribunal Judgment\r\n\r\n**Case No:** 2501558/2017  \r\n**Claimant:** Mr. Paul Gallant  \r\n**Respondent:** Stagecoach North East\r\n\r\n## Judgment Overview\r\n\r\nThe claimant’s application dated 21 March 2018 for reconsideration of the judgment sent on 16 March 2018 was **refused** under Rule 72 of the 2013 Employment Tribunal Rules.\r\n\r\n## Legal Basis\r\n\r\n- The tribunal may reconsider a judgment if necessary _in the interests of justice_ (Rules 70–72, 2013 Rules).\r\n- Applications must be made in writing within 14 days of the original decision.\r\n- Reconsideration is only granted if there is a reasonable prospect of varying or revoking the original decision.\r\n- Finality in litigation is important; unsuccessful parties are not automatically entitled to a second hearing.\r\n- New evidence must meet the **Ladd v Marshall** criteria:\r\n  1. Evidence could not have been obtained with reasonable diligence before the trial.\r\n  2. Evidence would probably have an important influence on the outcome.\r\n  3. Evidence is credible.\r\n\r\n## Claimant’s Arguments and Tribunal Findings\r\n\r\n- The claimant’s dyslexia did not impair his ability to present the case; no prior mention was made at the hearing.\r\n- Personal hardships, including the impact of Universal Credit sanctions and medical issues, were acknowledged but supported by insufficient evidence.\r\n- The claimant failed to provide medical documentation or timely evidence despite opportunities and advice.\r\n- The hearing’s scope was limited to whether the claim form was filed late; broader allegations were outside its remit.\r\n- The tribunal confirmed no procedural errors or exceptional circumstances warranted reconsideration.\r\n\r\n---\r\n\r\n**Date:** 6 April 2018\r\n","data":{"title":"Gallant v. Stagecoach","date":"25/06/2025","description":"Paul was fired from Stagecoach, and this started an unfair dismissal tribunal","tags":["history"]},"isEmpty":false,"excerpt":""},{"slug":"trip-to-college.mdx","content":"","data":{"title":"Trip to College","date":"25/06/2025","img":"/img/trip-to-college.png","description":"Paul took a trip to Nottingham College to ask about learning to code. He also wore a coat, which caused him to overheat and trip over in the street.","tags":["update"]},"isEmpty":false,"excerpt":""}]