[{"slug":"32k-tv.mdx","content":"\r\nIn the words of Paul at 32K TV, they \"aim to revolutionize the way we consume television by integrating cryptocurrency elements into the viewing experience\".\r\n\r\nAccording to their website, they are aiming to unveil the innovations by 2023.\r\n\r\nThe website continues to say that there are 2 phases to the project. TV sets, and Funding. To help finance this endeavor, Paul has said he is \"designing an Initial Coin Offering (ICO) as a two-fold solution\".\r\n\r\n## Features\r\n---\r\n\r\n### 32K TV Sets\r\nThese new TV sets will come equipped with a unique button that allows viewers to switch between normal and holographic images. Glasses will not be required to view the holographic images.\r\nThe screens will start at 65 inches and go up to 100 inches or more.","data":{"title":"32k TV","description":"The next generation of Ultra-Ultra-Ultra High Definition TV, with a Crypto twist.","content":"","logo":"","announceddate":"","releasedate":"","links":[{"label":"32k TV Website,","url":"https://32k-tv-inc.com/"}],"projecttype":"Televisions / Crypto-Token","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""},{"slug":"dual-energy.mdx","content":"\r\nThis is the Dual Energy page.","data":{"title":"Dual Energy","description":"Buy some land, fill it with wind and solar generators... profit?","logo":"","announceddate":"10/05/2024","releasedate":"","links":[{"label":"Facebook,","url":"https://www.facebook.com/profile.php?id=61559598838823"}],"projecttype":"Energy Company / Crypto-Token","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""},{"slug":"geordie-nation.mdx","content":"\r\nAcording to Paul, Geordie-Nation is a social platform dedicated to Newcastle upon Tyne. It enables users to connect with local people, support local businesses, and earn Geordie-Notes — crypto rewards for engaging in the community.\r\nThe platform focuses on building a vibrant local ecosystem by fostering connections, rewarding participation, and promoting Newcastle businesses.\r\n\r\nSo far the project is just a frontend shell, that doesn't allow for it to work. However Claude.ai, has said to Paul that it works, he has taken this as gospel.\r\n\r\nThe site is currently down, as Paul can't figure out how to point the DNS records to netlify and upload it to gitub.\r\n\r\nA rival site launched under the name \"Sunderland-Nation\" that was a recreation of the shell had earlier leaked his \"AI code\" for. It currently has functional social media ecosystem.\r\nFrom what has been said by Paul, the creator reached out to help Paul make his own site and do a possible merger.\r\n","data":{"title":"Geordie Nation","description":"A platform for businesses in Newcastle to connect.","logo":"/img/geordie-nation-logo.png","announceddate":"","releasedate":"30/06/2025","links":[],"projecttype":"Social Network","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""},{"slug":"seeking-you.mdx","content":"\r\nInitallySeeking you came across as a a social network that helps you meet people, but not in a dating kind of way. It's a place to find new friends, share experiences, and connect with others who have similar interests.\r\n\r\nPaul has said that the app is, \"Built for content creators by content creators. Stream unlimited, earn cryptocurrency, and connect with a global community in the safest environment on the web.\"\r\n\r\nThere was briefly a live site at [seeking-you.org](https://seeking-you.org) but it was never functional. Paul has claimed that the app will be back by the end of June 2025, but given his track record, it is unlikely that this will happen.\r\n\r\nThe version of the app that was live was built using an AI tool which generated some basic boilerplate frontend code, but no backend functionality.\r\n\r\nA new version have been created by Lovable which you can see [here](https://seeking-you-connect-verse.lovable.app/), again this is more boiler plate code, with no functionality. It appears to have less functionality than the inital Seeking-you\r\n","data":{"title":"Seeking You","description":"Meet people, but not in a <em>dating</em> kind of way.","logo":"","announceddate":"","releasedate":"30/06/2025","links":[{"label":"Website,","url":"https://www.Seeking-you.org/"},{"label":"Lovable.ai Version,","url":"https://seeking-you-connect-verse.lovable.app/"},{"label":"Seeking You 2","url":"https://www.Seeking-you2.org/"}],"projecttype":"Social Network","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""},{"slug":"streets-of-home.mdx","content":"\r\nThis is the Streets of Home page.","data":{"title":"Streets of Home","description":"A buggy racing game through the streets of Newcastle-upon-tyne.","logo":"","announceddate":"","releasedate":"31/12/2025","links":[{"label":"Github Repo","url":"https://github.com/Paulgallant/Street-s-of-Home-game"},{"label":"Second Github Repo","url":"https://github.com/Paulgallant/sb1-b72wsr3j"}],"projecttype":"Video game with crypto elements","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""},{"slug":"ubbc.mdx","content":"\r\nThis is the United Boat Builders Cup page.","data":{"title":"United Boat Builders Cup","description":"I think this is another racing game.. but boats this time?","logo":"","announceddate":"","releasedate":"","links":[],"projecttype":"Video Game","employees":"0","location":"Newcastle"},"isEmpty":false,"excerpt":""}]